Tekla Open API Reference for Tekla Structures 2025
Reinforcement.EndPointOffsetType Property
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Reinforcement.RebarOffsetTypeEnum EndPointOffsetType { get; set; }
Public Property EndPointOffsetType As Reinforcement.RebarOffsetTypeEnum
	Get
	Set
Property Value
Type: Reinforcement.RebarOffsetTypeEnum
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace